Revit 2027 API
RebarRoundingManager.ApplicableTotalLengthRoundingMethod Property
 The applicable rounding method for Bar Length and Total Bar Length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoundingMethod ApplicableTotalLengthRoundingMethod { get; }
Public ReadOnly Property ApplicableTotalLengthRoundingMethod As RoundingMethod
	Get
public:
property RoundingMethod ApplicableTotalLengthRoundingMethod {
	RoundingMethod get ();
}
member ApplicableTotalLengthRoundingMethod : RoundingMethod with get
Property Value
RoundingMethod
Remarks
 IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace